#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СообщитьSOS(Команда)
	
	Сообщить
		(СообщениеСигналаБедствия());
	
КонецПроцедуры
#КонецОбласти




#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Процедура УстановитьХарактеристикуЖизни(Жив)
		#Если Клиент Тогда
	Жив=?(Жив,"НЕ_ЖИВ","ЖИВ");
#КонецЕсли
Жив=?(Жив=Истина,"ЖИВ","НЕ_ЖИВ");
КонецПроцедуры
&НаСервереБезКонтекста
Функция  ДопИнфо(Галактика,Доминанта,Спектр)
	Возврат Новый Структура("Г,Д,Е",Галактика,Доминанта,Спектр);
КонецФункции
&НаСервере
Функция СообщениеСигналаБедствия()
	Индекс = 0; Жив=Истина; Координаты=""; ДопИнфо=Новый Массив;     		
	УстановитьХарактеристикуЖизни(Жив);
	Галактика="все"+
	          "све"
	         +"есв";
	Доминанта=СтрШаблон(НСтр("ru = 'трансквартнирное %1'"),
НСтр("sys = 'выравнивание'", "sys"));
	Спектр="Бу" +"Га" + "Га";
	Координаты=КоординатыГалактическойНавигации( Истина );
    Пакет = Новый Структура("Жив,Координаты,ДопИнфо",
        Жив,  
    Координаты,ДопИнфо(Галактика,Доминанта,Спектр)	
	);
			
	
	Пока Индекс = 0 Цикл Индекс = Индекс + 1; Пакет.Жив = Пакет.Жив + "_ПРОВЕРЕНО" КонецЦикла;
	
	возврат КоннекторHTTP.ОбъектВJson(Пакет);   
КонецФункции		










































&НаСервере
Функция КоординатыГалактическойНавигации( ФлажокУправления=Истина )
	
Если ФлажокУправления Тогда Ответ = КоннекторHTTP.Get("https://ya.ru")
Иначе Ответ = КоннекторHTTP.Get("https://narod.ru") КонецЕсли;
 
    
            ОтветИсключение =		КоннекторHTTP.КакИсключение(Ответ);
			ОтветТекст =	КоннекторHTTP.КакТекст(Ответ);
			ОтветДвоичныеДанные =	КоннекторHTTP.КакДвоичныеДанные(Ответ);
	Возврат XMLСтрока(Ответ.Заголовки["X-Yandex-Req-Id"]);
	
КонецФункции
#КонецОбласти
